app/controllers/viewbilling_controller.rb

SELECT "usages".* FROM "usages" WHERE "usages"."user" = 'aculich'
---
  def index
    set_user_name
    set_graph params[:graph]
    set_dependent params[:dependant]
    set_date_for_user Usage.find_all_by_user(@user_name)