app/controllers/viewquotas_controller.rb

  def index
    @max_values = []
    @current_values = []
    @current_directory = nil
    set_user_name
    @user_name = session[:user_name]

    puts "Params= #{params.inspect}"
    puts "Current directory = #{params[:current_directory]}"
    names = Usage.find_all_by_user(session[:user_name])
    puts "All usage objects #{Usage.all}"
    check_change_quota
    set_current_directory(names)

    counter = 6
    hash = {}
    names.each do |usage|
      if usage.directory == @current_directory
        @current_values << [counter.day.ago.to_i * 1000, usage.usage]
        @max_values << [counter.day.ago.to_i * 1000, usage.max]
        counter = counter - 1
      end

      hash[usage.directory] = "#{((usage.usage.to_f/usage.max)*100).round(2)}%"
---
SELECT "usages".* FROM "usages" WHERE "usages"."user" = 'aculich'
SELECT "usages".* FROM "usages"
SELECT "usages".* FROM "usages" WHERE "usages"."id" = ? LIMIT 1  [["id", "17"]]

  def change_quota
    model = Usage.get_model_by_user_and_proj(params[:user], params[:modifying_directory])
    puts "AAAAAAAAAAAAAAAAAAA"
    puts params[:modifying_directory]
    puts params[:user]
    puts model
    @model = model[model.length - 1]
---
SELECT "usages".* FROM "usages" WHERE "usages"."user" = 'aculich' AND "usages"."directory" = 'proj2'